# BOT replays to User


def task_canceled():
    text = '***Задание отменено***'
    return text
# =====================================================================================================================
#                                           ПОДПИСКА НА КАНАЛ
# =====================================================================================================================
def ch_task_not_active():
    text = 'Задание "Подписка на телеграмм-канал" не активно!\n ' \
                     'Воспользуйтесь кнопками меню для выбора задания'
    return text

def no_next_channel():
    text = 'К сожалению, новых тг-каналов не найдено. Вернитесь к заданию позже'
    return text

def subscribe(title):
    text = f"Подпишитесь на канал '{title}' и получите вознаграждение!\n Награда - 2 балла"
    return text

# =====================================================================================================================
#                                              ПРОСМОТР ПОСТА
# =====================================================================================================================
def post_task_not_active():
    text = 'Задание "Просмотр поста" не активно'
    return text

def goto_post(title, bonus):
    text = f"Перейдите к просмотру поста '{title}' и получите вознаграждение.\nНаграда - {bonus} балла"
    return text

def no_next_post():
    text = 'К сожалению, для данной категории сложности постов больше нет.\nВернитесь к заданию позже...'
    return text
